**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [66]:
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data)
df

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

In [67]:
df['labels'] = labels
df

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [68]:
df["birds"]

0        Cranes
1        Cranes
2       plovers
3    spoonbills
4    spoonbills
5        Cranes
6       plovers
7        Cranes
8    spoonbills
9    spoonbills
Name: birds, dtype: object

**3. Print the first 2 rows of the birds dataframe **

In [69]:
df.iloc[:2]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [70]:
df[["birds","age"]]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [71]:
df.loc[[2,3,7],"birds":"visits"]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [72]:
df[df["visits"]<4]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [172]:
#df[(df.age.isnull())]
#df["birds","visits"]
#d1[["birds","visits"]]
#df.columns[df.isna().any()].tolist()
df.loc[:,["birds","visits",["age"].isnull()]]

        birds  visits  age
0      Cranes       2  3.5
1      Cranes       4  4.0
2     plovers       3  1.5
3  spoonbills       4  NaN
4  spoonbills       3  6.0
5      Cranes       4  3.0
6     plovers       2  5.5
7      Cranes       2  NaN
8  spoonbills       3  8.0
9  spoonbills       2  4.0

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [249]:
df[(df["birds"]=="Cranes") & (df["age"]<4)]

    birds  age  visits  priority labels
0  Cranes  3.5       2         1      a
5  Cranes  3.0       4         0      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [219]:
#df[(df["age"]>=2) & (df["age"]<=4)]
#df[df["age"].between(2,4)]
df.loc[(df["age"]>=2) & (df["age"]<=4)]

        birds  age  visits  priority labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
5      Cranes  3.0       4         0      f
9  spoonbills  4.0       2         0      j

**10. Find the total number of visits of the bird Cranes**

In [263]:
df[df["birds"]=="Cranes"].visits.sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [276]:
df[["age"]].mean()

age    4.4375
dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [272]:
new_row = {'birds': "pegion",'age':20 ,'visits': 3,'priority':'yes' ,'labels':'k'}
df.append(new_row,ignore_index = True)

         birds   age  visits priority labels
0       Cranes   3.5       2        1      a
1       Cranes   4.0       4        1      b
2      plovers   1.5       3        0      c
3   spoonbills   NaN       4        1      d
4   spoonbills   6.0       3        0      e
5       Cranes   3.0       4        0      f
6      plovers   5.5       2        0      g
7       Cranes   NaN       2        1      h
8   spoonbills   8.0       3        0      i
9   spoonbills   4.0       2        0      j
10      pegion  20.0       3      yes      k

In [145]:
df.drop([9])

        birds  age  visits  priority labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5      Cranes  3.0       4         0      f
6     plovers  5.5       2         0      g
7      Cranes  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j

**13. Find the number of each type of birds in dataframe (Counts)**

In [273]:
df["birds"].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [282]:
res = df.sort_values(by=['age', 'visits'], ascending=[False, True])
res

        birds  age  visits  priority labels
8  spoonbills  8.0       3         0      i
4  spoonbills  6.0       3         0      e
6     plovers  5.5       2         0      g
9  spoonbills  4.0       2         0      j
1      Cranes  4.0       4         1      b
0      Cranes  3.5       2         1      a
5      Cranes  3.0       4         0      f
2     plovers  1.5       3         0      c
7      Cranes  NaN       2         1      h
3  spoonbills  NaN       4         1      d

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [133]:
df["priority"] = df["priority"].apply(lambda x: 1 if x=="yes" else 0)

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [149]:
df.replace(['Cranes'],'trumpeters')

        birds  age  visits  priority labels
0  trumpeters  3.5       2         1      a
1  trumpeters  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5  trumpeters  3.0       4         0      f
6     plovers  5.5       2         0      g
7  trumpeters  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j

In [ ]:
df.replace()